app/controllers/actors_controller.rb

INSERT INTO "actors" ("name", "birthday", "total_movies", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Jony"], ["birthday", "2013-03-01"], ["total_movies", 55], ["created_at", "2018-03-01 04:16:57.266959"], ["updated_at", "2018-03-01 04:16:57.266959"]]
---
  def create
    @actor = Actor.new(actor_params)

    respond_to do |format|
      if @actor.save

DELETE FROM "actors" WHERE "actors"."id" = ?  [["id", 6]]
---
  def destroy
    @actor.destroy

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_actor
      @actor = Actor.find(params[:id])