app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "release_date", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["release_date", "2020-04-13"], ["director", ""], ["created_at", "2018-03-01 01:52:55.145292"], ["updated_at", "2018-03-01 01:52:55.145292"]]
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save